export const navigation = [
  {
    id: "title",
    title: "Главная",
    path: "/",
  },
  {
    id: "News",
    title: "Новости",
    path: "/news",
  },
];

export const users = [
  {
    login: "admin",
    password: "admin",
    usertype: "admin",
  },
  {
    login: "user",
    password: "user",
    usertype: "user",
  },
];

export const news = [
  {
    id: 0,
    title: "Кошка построила домик!",
    text:
      "Но никого не впускает! Почему ты такая злюка и никого не пускаешь? Из-за лапок?",
    approved: true,
    createdAt: 1600560000000,
  },
  {
    id: 1,
    title: "Котика перепутали с хлебушком!",
    text: "И засунули в пакетик! По последним данным, он не очень этому рад.",
    approved: false,
    createdAt: 1600646400000,
  },
  {
    id: 2,
    title: "В аэропорту задержан котик!",
    text:
      "Он ничего не сделал, просто сотрудникам полиции не хватает милых котиков.",
    approved: true,
    createdAt: 1600732800000,
  },
  {
    id: 3,
    title: "Собачка залезла в коробку и сидит",
    text: "Зачем она это делает? Что это значит? Она что, кот?",
    approved: false,
    createdAt: 1600819200000,
  },
  {
    id: 4,
    title: "Местные крыски такие маленькие, такие утютю",
    text: "Нюх-нюх-нюх-нюх-нюх-нюх-нюх-нюх-нюх-нюх-нюх-нюх-нюх-нюх-нюх-нюх-нюх",
    approved: false,
    createdAt: 1600905600000,
  },
  {
    id: 5,
    title: "Доллар упал уже до 90 рублей",
    text: "Министерство кошачих дел заявило что они ничего не роняли",
    approved: true,
    createdAt: 1600992000000,
  },
  {
    id: 6,
    title: "Котик устроился программистом",
    text:
      "Вот только писать код он не может - у него лапки. Держись, котик, мы с тобой!",
    approved: false,
    createdAt: 1601078400000,
  },
];
